---
kind: property
id: P:Autodesk.Revit.DB.RoofBase.RoofType
source: html/8315630e-d579-70c1-3f64-37b8bbeaf0a0.htm
---
# Autodesk.Revit.DB.RoofBase.RoofType Property

Retrieve or set the Type.

## Syntax (C#)
```csharp
public RoofType RoofType { get; set; }
```